
# 복습


# 변수 , 함수 , 클래스 

# a = 1 #변수선언
# a() # 함수 method (함수는 중괄호를 사용한다.)
# A # 클래스 (보통 첫글자가 대문자로 시작한다.)
# 함수나 클래스는 선언을 하고 사용 할 수 있다.
# print()같이 기본적으로 제공해주는 시스템함수는 선언없이 사용할 수 있다.
# (import없이)

print() # 중괄호 -> 함수. 

print('hello world!')
print(100+100)
# 문자를 출력할 수 있다. 사칙연산이 가능하다.
print('100', 50)
# 프린트 함수 내 , 는 다음에 출력하라는 것으로 변수 타입이 달라도 출력이된다
print(100+5*2) 
# 사칙연산 순서대로 계산한다. 

# %d 정수 %f 실수 %s 문자열을 나타낸다. 
print('%d, %d'%(5,2))
print('%d + %d = %d'%(10,5,10+5))

print('%d * %d = %d'%(1,1,1*1))
print('%d * %d = %d'%(1,2,1*2))
print('%d * %d = %d'%(1,3,1*3))
print('%d * %d = %d'%(1,4,1*4))
print('%d * %d = %d'%(1,5,1*5))

print("%d %f"%(3.41,3.41)) # 정수만 출력, 실수 출력 
print('-'*10) #10번을 반복해라 
