import pandas as pd

df = pd.read_excel('2020년월별교통사고01.xlsx',skiprows=2,index_col='월')

print(df.columns)


df['교통사고 피해수(명)']=df['사망자수(명)']+df['부상자수(명)']

print(df['사고건수(건)'][[1,2,3,5,7]].mean())
# df.loc['합계'] = [0,0,0,0]
# df.loc['평균'] = [0,0,0,0]


# df.loc[['합계','평균'],'사고건수(건)'] = [df['사고건수(건)'].sum(),(df['사고건수(건)'].sum()/12)]
# df.loc[['합계','평균'],'사망자수(명)'] = [df['사망자수(명)'].sum(),(df['사망자수(명)'].sum()/12)]
# df.loc[['합계','평균'],'부상자수(명)'] = [df['부상자수(명)'].sum(),(df['부상자수(명)'].sum()/12)]
# df.loc[['합계','평균'],'교통사고 피해수(명)'] = [df['교통사고 피해수(명)'].sum(),(df['교통사고 피해수(명)'].sum()/12)]
# print(df.loc['합계'][0])
