
# str1 = '       파이  썬    수업'
# # 모든 빈공백을 제거 후 출력하세요 

# print(str1.replace(' ','')) # 모든공백다 지우기


# # split => 형태가 규칙적으로 되어있는 문자열을 리스트로 바꿔준다. 
# str1 = '1교시 2교시 3교시 4교시'

# list1 = str1.split()
# print(type(str1))
# print(type(list1))

# str2 = '1교시/2교시/3교시/4교시'
# print(str2.split('/'))

# str3 = '기준연도,기준월,읍면동,세대수,전체인구,전체인구남,전체인구여,내국인구수,내국인남,내국인여,외국인구수,외국인남,외국인여,연령별소계(내국인),0세,1세,2세,3세,4세,5세,6세,7세,8세,9세,10세,11세,12세,13세,14세,15세,16세,17세,18세,19세,20세,21세,22세,23세,24세,25세,26세,27세,28세,29세,30세,31세,32세,33세,34세,35세,36세,37세,38세,39세,40세,41세,42세,43세,44세,45세,46세,47세,48세,49세,50세,51세,52세,53세,54세,55세,56세,57세,58세,59세,60세,61세,62세,63세,64세,65세,66세,67세,68세,69세,70세,71세,72세,73세,74세,75세,76세,77세,78세,79세,80세,81세,82세,83세,84세,85세,86세,87세,88세,89세,90세,91세,92세,93세,94세,95세,96세,97세,98세,99세,100세,101세,102세,103세,104세,105세,106세,107세,108세,109세,110세이상'
# str3_list = str3.split(',')
# print(str3_list )

str1 = '990101-110555'
print(str1.split('-'))
date1 ='2022-03-21'
print(date1.split('-'))


# map 함수는 모든 타입을 일률적으로 변경해준다. 
before = ['2022', '03', '21'] #list 타입의 - str
after = list(map(int,before)) # 전제 조건이 리스트의 모든요소가 타입이 같아야한다.
print(after)


# # just , center, zfill  함수 가 있다. 

# str2 = '파이썬'
# print(str2.ljust(10,'-'))  # 왼쪽정렬
# print(str2.rjust(10,'-'))  # 오른쪽정렬
# print(str2.center(10,'-')) # 가운데 정렬
# print(str2.zfill(10))      # 오른쪽정렬(0으로채우기)

# num1 = '1' #->001, 10>010
# print(num1.zfill(3))

for i in range(1,11):
    i=str(i)
    if i == str(10):
        print(i.zfill(3),end='')    
    else:
        print(i.zfill(3),end=',')